app/Models/AuthModel.php

    public function checkData($username, $password){
        $db = \Config\Database::connect();
        $builder = $db->table('pengguna');
        return $builder->getWhere([
        'username' => $username,
        'password' => $password
        ])->getRow();
---
SELECT *
FROM `pengguna`
WHERE `username` = 'david'
AND `password` = 'aa743a0aaec8f7d7a1f01442503957f4d7a2d634'