app/Models/DokterModel.php

SELECT COUNT(*) AS `numrows`
FROM `dokter`
---
    public function getJumlahDokter()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('dokter');
        return $builder->countAllResults();