app/Models/PasienModel.php

SELECT COUNT(*) AS `numrows`
FROM `pasien`
WHERE `status` = 'aktif'
---
    public function getJumlahPasienAktif()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('pasien');
        $builder->where('status', 'aktif');
        return $builder->countAllResults();