app/Models/PenjadwalanModel.php

    public function kunjunganBulanan(){
        $db = \Config\Database::connect();
        $builder = $db->table('kunjungan k');
        $builder->select('k.id_kunjungan, k.id_pasien, k.id_antrian, a.tanggal, a.nomor_antrian, a.id_lokasi, a.jam_antrian')
                ->join('antrian a', 'k.id_antrian = a.id_antrian')
                ->where('k.status_kunjungan', 'hadir')
                ->where('MONTH(a.tanggal)', date('m'))
                ->where('YEAR(a.tanggal)', date('Y'));

        $count = $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `kunjungan` `k`
JOIN `antrian` `a` ON `k`.`id_antrian` = `a`.`id_antrian`
WHERE `k`.`status_kunjungan` = 'hadir'
AND MONTH(a.tanggal) = '12'
AND YEAR(a.tanggal) = '2024'

    public function kunjunganHarian(){
        $db = \Config\Database::connect();
        $builder = $db->table('kunjungan k');
        $builder->select('k.id_kunjungan, k.id_pasien, k.id_antrian, a.tanggal, a.nomor_antrian, a.id_lokasi, a.jam_antrian')
                ->join('antrian a', 'k.id_antrian = a.id_antrian')
                ->where('k.status_kunjungan', 'hadir')
                ->where('a.tanggal', date('Y-m-d'));

        $count = $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `kunjungan` `k`
JOIN `antrian` `a` ON `k`.`id_antrian` = `a`.`id_antrian`
WHERE `k`.`status_kunjungan` = 'hadir'
AND `a`.`tanggal` = '2024-12-18'

    public function getJumlahKunjunganPending()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('kunjungan');
        $builder->select('COUNT(*) AS jumlah_tidak_hadir');
        $builder->join('antrian', 'kunjungan.id_antrian = antrian.id_antrian');
        $builder->where('antrian.tanggal >= CURDATE()');
        $builder->where('kunjungan.status_kunjungan', 'tidak hadir');
        $count = $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `kunjungan`
JOIN `antrian` ON `kunjungan`.`id_antrian` = `antrian`.`id_antrian`
WHERE `antrian`.`tanggal` >= CURDATE()
AND `kunjungan`.`status_kunjungan` = 'tidak hadir'

    public function kunjunganPerBulan()
    {
        $db = \Config\Database::connect();
        $query = $db->table('kunjungan')
            ->select('MONTH(antrian.tanggal) as bulan, COUNT(*) as jumlah_kunjungan')
            ->join('antrian', 'kunjungan.id_antrian = antrian.id_antrian')
            ->where('kunjungan.status_kunjungan', 'hadir')
            ->where('YEAR(antrian.tanggal)', date('Y'))
            ->groupBy('MONTH(antrian.tanggal)')
            ->orderBy('MONTH(antrian.tanggal)', 'ASC')
            ->get();
---
SELECT MONTH(antrian.tanggal) as bulan, COUNT(*) as jumlah_kunjungan
FROM `kunjungan`
JOIN `antrian` ON `kunjungan`.`id_antrian` = `antrian`.`id_antrian`
WHERE `kunjungan`.`status_kunjungan` = 'hadir'
AND YEAR(antrian.tanggal) = '2024'
GROUP BY MONTH(antrian.tanggal)
ORDER BY MONTH(antrian.tanggal) ASC