app/Models/UserModel.php

SELECT COUNT(*) AS `numrows`
FROM `pengguna`
WHERE `role` = 'admin'
---
    public function getJumlahAdmin()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('pengguna');
        $builder->where('role', 'admin');
        return $builder->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `pengguna`
WHERE `role` = 'hrd'
---
    public function getJumlahHRD()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('pengguna');
        $builder->where('role', 'hrd');
        return $builder->countAllResults();